"""
计算方式是我猜的,实际计算方式我不知道
简化为50%占空比时,纹波最大情况

不过我用仿真查看了1、2、3、4级RC,数据基本一致
用示波器看了下1、2级RC,数据基本一致
又用示波器看了1、2、3级RC也是准的
"""

# 输入参数
import math


r = 1  # K
c = 4.7  # n
v = 3.2  # V
f = 0.3125  # Mhz


# 修正单位
r *= 1_000
c /= 1_000_000_000
v = v
f *= 1_000_000

# 系数,一级用方波，二级用三角波，三级和三级以后用正弦波
# 按照0.5占空比时纹波最大计算
pwm = 4
三角波 = 8
正弦波 = 6.28

# 计算多少级RC
计算多少级 = 6

# 计算结果
tao = r * c
rc衰减倍数 = []
rc衰减倍数.append(f * r * c * pwm)
rc衰减倍数.append(f * r * c * 三角波)
for i in range(计算多少级 - 2):
    rc衰减倍数.append(f * r * c * 正弦波)
截止频率 = 1 / (2 * math.pi * r * c)
截止倍数 = f / 截止频率

# 输出结果
if 截止倍数 <= 10:
    print(f"\033[31m截止频率: {截止频率 / 1000:.2f} khz 倍数: {截止倍数:.2f}\033[0m")
else:
    print(f"截止频率: {截止频率 / 1000:.2f} khz 倍数: {截止倍数:.2f}")

rc纹波 = v
for i in range(计算多少级):
    rc纹波 /= rc衰减倍数[i]
    截止频率 = 1 / (2 * math.pi * r * c) * math.sqrt(2 ** (1 / (i + 1)) - 1)
    tao = 1 / (2 * math.pi * 截止频率)
    print(
        f"{i + 1}级RC最大纹波: {rc纹波 * 1000:6.2f} mv\
        本级纹波衰减: {rc衰减倍数[i]:5.2f} 倍\
        涛 = {tao * 1_000_000:5.2f} us\
        等效正弦波rc截止频率: {截止频率 / 1000:.2f} K"
    )


"""
-------------------------------------------------------
| 分辨率 (Bit) | 占空比级数 (Steps) | 最大频率 (理论上限) | 常用场景建议         |
| :----------- | :----------------- | :------------------ | :------------------- |
| 1 bit        | 2                  | 40,000,000 Hz       | 极高频时钟基准       |
| 2 bits       | 4                  | 20,000,000 Hz       | 高速逻辑切换         |
| 3 bits       | 8                  | 10,000,000 Hz       | 高频信号调制         |
| 4 bits       | 16                 | 5,000,000 Hz        | 简易 DCDC 转换控制   |
| 5 bits       | 32                 | 2,500,000 Hz        | 中高频功率控制       |
| 6 bits       | 64                 | 1,250,000 Hz        | 超声波驱动           |
| 7 bits       | 128                | 625,000 Hz          | 高速电机驱动         |
| 8 bits       | 256                | 312,500 Hz          | 工业电机 / 基础调光  |
| 9 bits       | 512                | 156,250 Hz          | 手机摄影无频闪调光   |
| 10 bits      | 1,024              | 78,125 Hz           | 高精度 LED 调光      |
| 11 bits      | 2,048              | 39,062 Hz           | 细腻亮度过渡         |
| 12 bits      | 4,096              | 19,531 Hz           | 常用音频频率模拟     |
| 13 bits      | 8,192              | 9,765 Hz            | 舵机控制 (高精度)    |
| 14 bits      | 16,384             | 4,882 Hz            | 高精度传感器模拟     |
| 15 bits      | 32,768             | 2,441 Hz            | 医疗/实验室级模拟    |
| 16 bits      | 65,536             | 1,220 Hz            | 极高分辨率音频       |
| 17 bits      | 131,072            | 610.3 Hz            | 低频平滑控制         |
| 18 bits      | 262,144            | 305.1 Hz            | -                    |
| 19 bits      | 524,288            | 152.5 Hz            | -                    |
| 20 bits      | 1,048,576          | 76.2 Hz             | 硬件支持的极限位深   |
-------------------------------------------------------
公式: Max_Freq = 80,000,000 / (2^bits)
注意: 实际使用时频率设置应略低于上限值以确保定时器稳定。
"""
